Tekla Open API Reference for Tekla Structures 2025
Polygon Properties
The Polygon type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the polygon.
Bulge
 The bulge (curve) to use for the polygon (a bulge is the ratio between the height and width of an object).
Bulges
 The list of individual bulges for the polygon.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
Points
 The list of points for the polygon.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Polygon Class
Tekla.Structures.Drawing Namespace